<a href="https://colab.research.google.com/github/albertomendess/Data-Science/blob/main/TRATAMENTO_DE_DADOS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Relatório de Análise

In [ ]:
import pandas as pd

In [ ]:
dados = pd.read_csv('/content/aluguel_residencial.csv', sep= ';')
dados.head(5)

   Unnamed: 0         Tipo           Bairro  ...   Valor  Condominio  IPTU
0           0    Quitinete       Copacabana  ...  1700.0       500.0  60.0
1           1         Casa  Jardim Botânico  ...  7000.0         NaN   NaN
2           2  Apartamento           Centro  ...   800.0       390.0  20.0
3           3  Apartamento     Higienópolis  ...   800.0       230.0   NaN
4           4  Apartamento     Vista Alegre  ...  1200.0         NaN   NaN

[5 rows x 10 columns]

In [ ]:
dados.isnull().sum()

Unnamed: 0       0
Tipo             0
Bairro           0
Quartos          0
Vagas            0
Suites           0
Area             0
Valor            0
Condominio    1813
IPTU          6780
dtype: int64

In [ ]:
dados.notnull()

       Unnamed: 0  Tipo  Bairro  Quartos  ...  Area  Valor  Condominio   IPTU
0            True  True    True     True  ...  True   True        True   True
1            True  True    True     True  ...  True   True       False  False
2            True  True    True     True  ...  True   True        True   True
3            True  True    True     True  ...  True   True        True  False
4            True  True    True     True  ...  True   True       False  False
...           ...   ...     ...      ...  ...   ...    ...         ...    ...
22575        True  True    True     True  ...  True   True        True   True
22576        True  True    True     True  ...  True   True        True   True
22577        True  True    True     True  ...  True   True        True   True
22578        True  True    True     True  ...  True   True        True   True
22579        True  True    True     True  ...  True   True        True  False

[22580 rows x 10 columns]

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  22580 non-null  int64
 1   Tipo        22580 non-null  object
 2   Bairro      22580 non-null  object
 3   Quartos     22580 non-null  int64
 4   Vagas       22580 non-null  int64
 5   Suites      22580 non-null  int64
 6   Area        22580 non-null  int64
 7   Valor       22571 non-null  float64
 8   Condominio  20765 non-null  float64
 9   IPTU        15795 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 1.7+ MB

In [ ]:
dados[dados['Valor'].isnull()]

      Unnamed: 0         Tipo           Bairro  ...  Valor  Condominio   IPTU
58            58  Apartamento  Barra da Tijuca  ...    NaN       970.0   68.0
1492        1492  Apartamento             Leme  ...    NaN       878.0    NaN
1683        1683         Casa     Campo Grande  ...    NaN         NaN    NaN
2012        2012  Apartamento         Botafogo  ...    NaN      1010.0  170.0
2034        2034  Apartamento       Copacabana  ...    NaN       850.0    NaN
4941        4941         Casa     Campo Grande  ...    NaN         NaN    NaN
8568        8568  Apartamento             Leme  ...    NaN       878.0    NaN
8947        8947  Apartamento           Glória  ...    NaN       910.0  228.0
9149        9149  Apartamento            Gávea  ...    NaN       880.0  221.0

[9 rows x 10 columns]

In [ ]:
a = dados.shape[0]
dados.dropna(subset= ['Valor'], inplace= True)
b = dados.shape[0]
a - b

9

### Tratamento de Dados Faltantes

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

1813

In [ ]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [ ]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

745

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

1068

In [ ]:
dados = dados.fillna({'Condominio': 0, 'IPTU': 0})

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [ ]:
dados[dados['IPTU'].isnull()].shape[0]

0

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21826 non-null  int64
 1   Tipo        21826 non-null  object
 2   Bairro      21826 non-null  object
 3   Quartos     21826 non-null  int64
 4   Vagas       21826 non-null  int64
 5   Suites      21826 non-null  int64
 6   Area        21826 non-null  int64
 7   Valor       21826 non-null  float64
 8   Condominio  21826 non-null  float64
 9   IPTU        21826 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 1.8+ MB

In [ ]:
dados.to_csv('/content/aluguel_residencial.csv', sep= ';', index= False)